Revit 2024 API
ParameterValue.Copy Method
 Makes an identical copy of the given parameter value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016 Subscription Update
Syntax
C#
public ParameterValue Copy()
Visual Basic
Public Function Copy As ParameterValue
Visual C++
public:
ParameterValue^ Copy()
See Also
ParameterValue Class
Autodesk.Revit.DB Namespace